Org/learning_emacs/emacsday5.html

<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>emacsday5</title>
<!-- 2019-04-11 周四 22:32 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />


</head>
<body>
<div id="content">
<h1 class="title">emacsday5</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. emacsday5</a>
<ul>
<li><a href="#sec-1-1">1.1. 关于一些常用的优化</a></li>
<li><a href="#sec-1-2">1.2. 优化页面设计开发效率</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. web-mode</a></li>
<li><a href="#sec-1-2-2">1.2.2. js2-refactor</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. occur and imenu</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. occur</a></li>
<li><a href="#sec-1-3-2">1.3.2. imenu</a></li>
<li><a href="#sec-1-3-3">1.3.3. iedit-mdoe</a></li>
<li><a href="#sec-1-3-4">1.3.4. org-mode</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> emacsday5</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 关于一些常用的优化</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>解决打单引号出现两个的问题，这在emacs-mode中是比较烦的
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(sp-local-pair 'emacs-lisp-mode "'" nil :actions nil)
</pre>
</div>

<ul class="org-ul">
<li>让光标在语句中间的时候也可以高亮最外层的括号
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(define-advice show-paren-function (:around (fn) fix-show-paren-function)
  "Highlight enclosing parens."
  (cond ((looking-at-p "\\s(") (funcall fn))
	(t (save-excursion
	     (ignore-errors (backward-up-list))
	     (funcall fn)))))
</pre>
</div>
<p>
&#x2013; define-advice类似于C语言的宏。
&#x2013; 上面的(save-excursion)是保存光标和插入点，当执行的函数结束后，再次回到这里的时候，恢复
&#x2013; 之前保存的光标和插入点
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 优化页面设计开发效率</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">;;隐藏HTML界面的^M
(defun hidden-dos-eol ()
  "Do not show ^M in files containing mixed UNIX nad DOS line ending."
(interactive)
(setq buffer-display-table (make-display-table))
(aset buffer-display-table ?\^M []))

;;移除HTML界面的^M
(defun remove-dos-eol ()
  "Replace DOS eolns CR with Unix eolns CR"
(interactive)
(goto-char (point-min))
(while (search-forward "\r" nil t) (replace-match "")))
</pre>
</div>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> web-mode</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>下面是为了在进行html设计的时候，能够通过快捷键更换缩进的空格数，在2和4之间进行切换
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun my-web-mode-indent-setup ()
(setq web-mode-markup-indent-offset 2)
(setq web-mode-css-indent-offset 2)
(setq web-mode-code-indent-offset 2)
)

(add-hook 'web-mode-hook 'my-web-mode-indent-setup)

(defun my-toggle-web-indent ()
(interactive)
;;web development
(if (or (eq major-mode 'js-mode) (eq major-mode 'js2-mode))
(progn
(setq js-indent-level (if (= js-indent-level 2) 4 2))
(setq js2-basic-offset (if (= js2-basic-offset 2) 4 2))))

(if (eq major-mode 'web-mode)
(progn 
(setq web-mode-markup-indent-offset (if (= web-mode-markup-indent-offset 2) 4 2))
(setq web-mode-css-indent-offset (if (= web-mode-css-indent-offset 2) 4 2))
(setq web-mode-code-indent-offset (if (= web-mode-code-indent-offset 2) 4 2))))

(if (eq major-mode 'css-mode)
(setq css-indent-offset (if (= css-indent-offset 2) 4 2)))

(setq indent-tabs-mode nil))

(global-set-key (kbd "C-c t i") 'my-toggle-web-indent)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> js2-refactor</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>具体的功能还不是很熟悉，以后使用的时候看看笔记来熟悉
</li>
</ul>
<p>
-在进行js代码编写的时候，可以增加效率
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">;;config for js2-refactor
(add-hook 'js2-mode-hook #'js2-refactor-mode)
(js2r-add-keybindings-with-prefix "C-c C-m")
</pre>
</div>

<p>
提供了很多重构的功能，在以后使用的时候，根据文档来使用
C-c C-m ef将选中的代码封装成一个函数
C-c C-m mf将选中的代码封装成一个类
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> occur and imenu</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> occur</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>在进行查找的时候，将当前选中的区域当作是默认查找的字符串
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">;;dwim = do what i mean.
(defun occur-dwim ()
  "Call 'occur' with a sane default"
  (interactive)
  (push (if (region-active-p)
	    (buffer-substring-no-properties
	     (region-beginning)
	     (region-end))
	     (let ((sym (thing-at-point 'symbol)))
	       (when (stringp sym))))
	  regexp-history)
  (call-interactively 'occur))

(global-set-key (kbd "M-s o") 'occur-dwim)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> imenu</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>将当前缓冲区的函数列出来，可以进行跳转
</li>
<li>有一段很长的关于正则表达式的代码，由于暂时可能不会用到 ，所以没有抄录，具体代码见视频50：
<ol class="org-ol">
<li>
</li>
</ol>
</li>

<li>expand-region
</li>
<li>能够更加方便地选中一些区域，按C-=能够进行选中区域的扩充，同理C&#x2013;(ctrl加'-'可以进行选中区
域的缩减)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> iedit-mdoe</h4>
<div class="outline-text-4" id="text-1-3-3">
<ul class="org-ul">
<li>选中某一个词语，可以进行批量编辑，默认的快捷键是:"C-;"
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> org-mode</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2019-04-11 周四 22:32</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
